driver-tests/bpelse/nmproperty/dynamicaddressingNMproperty/src/dynamicaddressingNMproperty.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="dynamicaddressingNMproperty" targetNamespace="http://j2ee.netbeans.org/wsdl/dynamicaddressingNMproperty/dynamicaddressingNMproperty"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/dynamicaddressingNMproperty/dynamicaddressingNMproperty" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types/>
    <message name="dynamicaddressingNMpropertyOperationRequest">
        <part name="part1" type="xsd:string"/>
    </message>
    <message name="dynamicaddressingNMpropertyOperationResponse">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="dynamicaddressingNMpropertyPortType">
        <operation name="dynamicaddressingNMpropertyOperation">
            <input name="input1" message="tns:dynamicaddressingNMpropertyOperationRequest"/>
            <output name="output1" message="tns:dynamicaddressingNMpropertyOperationResponse"/>
        </operation>
    </portType>
    <binding name="dynamicaddressingNMpropertyBinding" type="tns:dynamicaddressingNMpropertyPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="dynamicaddressingNMpropertyOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/dynamicaddressingNMproperty/dynamicaddressingNMproperty"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/dynamicaddressingNMproperty/dynamicaddressingNMproperty"/>
            </output>
        </operation>
    </binding>
    <service name="dynamicaddressingNMpropertyService">
        <port name="dynamicaddressingNMpropertyPort" binding="tns:dynamicaddressingNMpropertyBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/dynamicaddressingNMpropertyService/dynamicaddressingNMpropertyPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="dynamicaddressingNMproperty">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="dynamicaddressingNMpropertyPortTypeRole" portType="tns:dynamicaddressingNMpropertyPortType"/>
    </plnk:partnerLinkType>
</definitions>
